In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    'name': ['ali', 'khan', 'sher', 'far'],
    'age': [32, 43, 65, 34],
    'marks': [45, 78, 65, 90]
}
df = pd.DataFrame(dict1)
print(df)

   name  age  marks
0   ali   32     45
1  khan   43     78
2  sher   65     65
3   far   34     90

In [3]:
df.to_csv("friends_csv")

In [4]:
df.to_csv("friends_index_False_csv", index=False)

In [5]:
df.head(3)

   name  age  marks
0   ali   32     45
1  khan   43     78
2  sher   65     65

In [6]:
df.tail(2)

   name  age  marks
2  sher   65     65
3   far   34     90

In [7]:
df.describe()

             age     marks
count   4.000000   4.00000
mean   43.500000  69.50000
std    15.110703  19.26136
min    32.000000  45.00000
25%    33.500000  60.00000
50%    38.500000  71.50000
75%    48.500000  81.00000
max    65.000000  90.00000

In [8]:
ali = pd.read_csv("ali.csv")

In [9]:
ali

   Unnamed: 0 last name  marks  age
0           0       ali     32   45
1           1      khan     43   78
2           2      sher     65   65
3           3       far     34   90

In [10]:
ali['marks']

0    32
1    43
2    65
3    34
Name: marks, dtype: int64

In [11]:
ali["marks"][0]

32

In [12]:
ali['marks'][0] = 40

C:\Users\A&Z\AppData\Local\Temp\ipykernel_3564\138749720.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ali['marks'][0] = 40

In [13]:
ali

   Unnamed: 0 last name  marks  age
0           0       ali     40   45
1           1      khan     43   78
2           2      sher     65   65
3           3       far     34   90

In [14]:
ali.index=[4, 5,6, 7]

In [15]:
ali

   Unnamed: 0 last name  marks  age
4           0       ali     40   45
5           1      khan     43   78
6           2      sher     65   65
7           3       far     34   90